app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
---
    <div class="container">
        <h2 class="count-cmt"><%= @post.comments.count %> <%=t('.comments') %></h2>