app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at", "post_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "alo"], ["created_at", "2021-12-17 12:03:22.360426"], ["updated_at", "2021-12-17 12:03:22.360426"], ["post_id", 3], ["user_id", "1"]]
---
    def create
        if current_user
            @post = Post.find(params[:post_id])
            @comment = @post.comments.create(user_id: session[:user_id], content: comment_params[:content])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 3], ["id", 9], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 9]]
---
    def destroy
        if current_user
            @post = Post.find(params[:post_id])
            @comment = @post.comments.find(params[:id])
            @comment.destroy