app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id", "topic", "title") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        if current_user
            @post = Post.new(user_id: session[:user_id], title: post_params[:title], content: post_params[:content], topic: post_params[:topic])
            if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def show
        if current_user
            @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = ?, "title" = ? WHERE "posts"."id" = ?  [["updated_at", "2021-12-18 16:48:07.765604"], ["title", "Love story"], ["id", 8]]
---
    def update
        if current_user
            @post = Post.find(params[:id])

            if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def edit
        if current_user
            @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
---
    def destroy
        if current_user
            @post = Post.find(params[:id])
            @post.destroy